package com.example.syntaxis

 open class a {
    val a = 1
     // при создании пакета назва пишиться з маленькоъ букви без підчеркування и чорточок com.example.project
     //
     //Всі класи пишуться з великої букви // NewClass
     //
     //екземпляр класа // val newClass =  NewClass()
     //
     //функції создаються з маленької букви а леййаути з маленької і нижнім підкреслюванням
     //
     //в созданії фрагнемнта верхне імя класа , нижнне лейаута(xml)
     //
     // знаки !! = игнорувати пусте значення
     //
     //
     //
     //
     //
     //
     //
     //
}